{"pageProps":{"post":{"slug":"blog_post_first_incident","title":"The First Incident Changes Everything","date":"2025-12-20","excerpt":"There's a moment when ownership stops being theoretical and becomes visceral. It usually happens at 3 AM, with a production line stopped and people asking questions you don't have answers to yet.","author":{"name":"Inderpreet Singh","avatar":"IS"},"image":"/images/posts/first-incident.png","tags":["incidents","ownership","production","systems"],"likes":0,"comments":0,"content":"<p>The pager goes off at 2:47 AM. You&#39;re the firmware lead for a new motor control system that&#39;s been in production for six weeks. It&#39;s been running fine. No issues. And then: &quot;Line 3 emergency stop. Controllers unresponsive. Production halted.&quot;</p>\n<p>You&#39;re on a call by 2:52. The plant manager is already there—in person, at the facility, at 3 AM. The line is still down. Every minute costs money you&#39;ve only thought about abstractly until now. The operators are watching. Maintenance is standing by. And everyone is looking at your system.</p>\n<p>Not metaphorically looking. Actually standing in front of the cabinet, pointing at LEDs, asking what they mean.</p>\n<p>You realize, with a clarity that&#39;s almost physical, that you don&#39;t know. You know what they&#39;re supposed to mean. You wrote the documentation. But right now, with the system in an unknown state, you&#39;re not sure. You&#39;re running mental simulations, trying to map LED patterns to states, wondering if the watchdog triggered or if it&#39;s a CAN bus fault or if something else entirely happened.</p>\n<p>The plant manager asks: &quot;How long until we&#39;re back up?&quot;</p>\n<p>This is the moment. Not the moment you become an experienced engineer. The moment you realize you weren&#39;t one yet.</p>\n<h2>When Ownership Becomes Real</h2>\n<p>Before your first real incident, ownership is theoretical. You own the firmware, sure. Your name is on the commit history. You wrote the architecture doc. You presented at the design review.</p>\n<p>But that&#39;s ownership as authorship. Ownership as credit.</p>\n<p>Real ownership is different. Real ownership is: when this breaks, you get called. When it misbehaves, you explain why. When someone needs to make a decision about whether to push forward or shut down, they&#39;re looking at you for information that might not exist yet.</p>\n<p>The shift happens fast. One moment you&#39;re proud of what you built. The next moment you&#39;re responsible for it in a way that makes pride seem quaint.</p>\n<p>I remember my first significant incident. A PLC I&#39;d written firmware for started dropping Modbus requests unpredictably. Not often—maybe one in ten thousand. Enough to be noticeable in production but rare enough that we&#39;d never caught it in testing. The system had error handling. It would retry. But the retries added latency, and that latency cascaded into other systems, and suddenly a water treatment facility was dealing with tank levels that were drifting outside normal operating ranges.</p>\n<p>No one was angry. Everyone was professional. But I could feel the weight of it: this wasn&#39;t my code anymore. It was their water treatment system. Their compliance requirements. Their operators who had to explain to management why levels were fluctuating.</p>\n<p>The code was the same. The system was the same. But what it meant was different.</p>\n<h2>How Teams Behave Under Public Failure</h2>\n<p>Here&#39;s something they don&#39;t teach you: teams change during incidents.</p>\n<p>The usual dynamics suspend. The person who never speaks up in meetings suddenly has crucial information. The senior engineer who usually drives decisions steps back and lets the person closest to the problem lead. Or sometimes the opposite happens—someone who&#39;s normally collaborative becomes territorial, defensive.</p>\n<p>You learn who stays calm and who doesn&#39;t. Who asks clarifying questions and who jumps to conclusions. Who admits when they don&#39;t know something and who deflects. Who thinks about the system and who thinks about blame.</p>\n<p>This isn&#39;t about good people versus bad people. It&#39;s about how pressure reveals what people actually optimize for when the stakes are real.</p>\n<p>I&#39;ve watched a junior technician with three months on the job diagnose a problem faster than anyone else because they&#39;d been the one doing the daily rounds and noticed a pattern no one else had seen. I&#39;ve watched a principal engineer who designed the original system defer to an operator who knew which breaker &quot;acted funny&quot; in a way no documentation captured.</p>\n<p>I&#39;ve also watched teams spiral. Someone suggests a theory, and instead of testing it, everyone starts building on it. Someone makes a change without announcing it, and now two people are modifying the same system with different assumptions. Someone gets frustrated and starts blaming the vendor, the previous team, the budget constraints—anything except the current problem.</p>\n<p>The best incident response I&#39;ve seen wasn&#39;t the fastest. It was the most deliberate. Someone—it happened to be a controls engineer who&#39;d been with the company for fifteen years—said: &quot;We don&#39;t understand what state we&#39;re in. Before we change anything, let&#39;s gather data.&quot; And then, critically: &quot;Who&#39;s writing this down?&quot;</p>\n<p>That changed everything. Not because documentation mattered in the moment, but because it forced everyone to externalize their mental model. When you have to say out loud what you think is happening and someone writes it down, you think differently. You catch your own assumptions.</p>\n<h2>What Broke Wasn&#39;t the System</h2>\n<p>After the incident, there&#39;s always a postmortem. And almost always, the postmortem focuses on the technical failure.</p>\n<p>In that motor control incident at 3 AM, the technical root cause was clear: a race condition in the watchdog handling code. Under specific timing conditions, the watchdog could timeout while a critical section was locked, and the recovery path assumed clean state that didn&#39;t exist. Textbook bug. We fixed it in forty lines of code.</p>\n<p>But that wasn&#39;t what broke.</p>\n<p>What broke was that the firmware had been written with assumptions about the execution environment that were true on the test bench and false in production. The test bench had consistent loop timing. Production had variable timing because of interrupt patterns we hadn&#39;t characterized. We&#39;d tested the watchdog recovery path, but we&#39;d tested it by triggering the watchdog deliberately, not by letting it trigger from timing variance.</p>\n<p>Okay, but that still sounds technical. Go deeper.</p>\n<p>Why didn&#39;t we characterize the interrupt patterns in production? Because commissioning was scheduled tight, and characterization takes time, and we had twelve other systems to bring up. </p>\n<p>Why was commissioning scheduled tight? Because the project was already over budget, and the plant needed the new line operational before the next quarter.</p>\n<p>Why was the project over budget? Partly because the scope grew during implementation, partly because integration with legacy systems took longer than estimated, partly because we&#39;d optimized the bid to win the contract.</p>\n<p>Who decided that the commissioning schedule was more important than thorough characterization? No one, explicitly. It was a collective drift. A series of small decisions that each made sense locally but accumulated into a gap where critical testing didn&#39;t happen.</p>\n<p>Here&#39;s what actually broke: the communication path between the firmware team and the commissioning team. We didn&#39;t have a clear handoff protocol for &quot;things that need to be validated in production that we can&#39;t validate in the lab.&quot; That&#39;s not a technical problem. That&#39;s an organizational design problem.</p>\n<p>And beneath that: the incentive structure. Commissioning engineers were measured on schedule adherence. Firmware engineers were measured on feature completion. No one was measured on &quot;probability we understand the system&#39;s actual behavior in production.&quot;</p>\n<p>So we didn&#39;t do it. Not because anyone was negligent. Because the organization wasn&#39;t designed to value it.</p>\n<h2>Why Technical Postmortems Often Miss the Point</h2>\n<p>Most postmortems I&#39;ve read follow a pattern:</p>\n<p><strong>Incident summary</strong>: What happened and when<br><strong>Impact</strong>: Who was affected and how<br><strong>Root cause</strong>: The technical failure<br><strong>Contributing factors</strong>: Other technical issues<br><strong>Action items</strong>: Technical fixes</p>\n<p>This format is comfortable because it suggests the problem was technical and therefore fixable. Change the code, add a check, improve the test suite. Done.</p>\n<p>But look at what&#39;s missing:</p>\n<ul>\n<li>Why did the design review not catch this failure mode?</li>\n<li>What information existed that wasn&#39;t shared?</li>\n<li>Which tradeoffs were made consciously versus unconsciously?</li>\n<li>What incentives led to those tradeoffs?</li>\n<li>How did the team&#39;s understanding of the system differ from reality?</li>\n</ul>\n<p>These questions are harder because the answers implicate decisions, not just code. They make people uncomfortable because they suggest the incident wasn&#39;t just bad luck or an obscure bug—it was predictable given how the system was designed and how the organization operates.</p>\n<p>I once sat in a postmortem for a system that failed because of insufficient input validation. The root cause was listed as &quot;missing bounds check.&quot; The action item was &quot;add bounds checking to all inputs.&quot;</p>\n<p>But the actual story was different. The bounds checking had been in the original design. It was removed during optimization because it added 2ms to the control loop latency, and the spec required sub-10ms response time. The decision to remove it was documented in a code review but not escalated. The person who reviewed it assumed someone else would catch it in integration testing. The integration testing was abbreviated because commissioning was behind schedule.</p>\n<p>The missing bounds check was the mechanism of failure. But what failed was a web of assumptions about who was responsible for verifying what, under what time pressure, with what communication overhead.</p>\n<p>Fixing the bounds check addressed the symptom. It didn&#39;t address why a known-critical validation got removed without proper scrutiny.</p>\n<h2>&quot;The System Worked Exactly as Designed&quot;</h2>\n<p>This phrase appears in postmortems as a conclusion. It&#39;s meant to close the investigation: there was no malfunction, just an unanticipated scenario.</p>\n<p>But it&#39;s the most dangerous phrase in incident analysis because it&#39;s almost always true—and almost always misunderstood.</p>\n<p>Yes, the system worked as designed. The problem is that &quot;the design&quot; includes far more than you documented.</p>\n<p>It includes the implicit assumptions you made about the operating environment. The tradeoffs you accepted to meet the schedule. The risks you deprioritized because they seemed unlikely. The monitoring you didn&#39;t implement because it wasn&#39;t in scope. The operational knowledge that exists only in people&#39;s heads.</p>\n<p>When the motor controllers became unresponsive at 2:47 AM, they worked exactly as designed: the watchdog detected a timeout, triggered the recovery path, and entered a safe state. The recovery path was designed to reset the system to a known-good state. It did that.</p>\n<p>What it didn&#39;t do was account for the scenario where the &quot;known-good state&quot; wasn&#39;t actually safe because other systems were depending on outputs that were now frozen at their last value. That wasn&#39;t a bug in the recovery logic. That was a gap in the system-level design.</p>\n<p>But more than that: it was a gap in how we thought about the system. We&#39;d designed the controller firmware in isolation, with defined interfaces. We&#39;d assumed those interfaces were sufficient to capture the dependencies. They weren&#39;t. The actual dependencies included timing relationships, implicit state machines in other systems, and operator expectations that weren&#39;t written anywhere.</p>\n<p>The system worked exactly as designed. The design was incomplete.</p>\n<h2>The Difference Between Intent and Reality</h2>\n<p>There&#39;s a moment during every significant incident where you realize: we built what we said we&#39;d build. We just didn&#39;t build what was needed.</p>\n<p>Not because we were incompetent. Because reality is richer than specification.</p>\n<p>The spec said &quot;handle watchdog timeout.&quot; It didn&#39;t say &quot;handle watchdog timeout in a way that doesn&#39;t leave dependent systems in ambiguous state.&quot; That seemed implied. It wasn&#39;t.</p>\n<p>The spec said &quot;buffer sensor data during communication loss.&quot; It didn&#39;t say &quot;buffer data in a way that&#39;s meaningful when different sensors lose communication at different times.&quot; We assumed synchronization. The assumption was wrong.</p>\n<p>The spec said &quot;provide HMI feedback for fault conditions.&quot; It didn&#39;t say &quot;provide feedback that operators can interpret correctly at 3 AM when multiple faults are active simultaneously.&quot; We tested each fault individually. They don&#39;t happen individually in production.</p>\n<p>Intent and reality diverge in the space between what you specify and what you assume. And you don&#39;t discover what you assumed until it&#39;s tested in an environment that doesn&#39;t share your assumptions.</p>\n<h2>What Changes After</h2>\n<p>The first incident changes everything because it changes what &quot;working&quot; means.</p>\n<p>Before: working meant passing tests, meeting specifications, behaving correctly under expected conditions.</p>\n<p>After: working means remaining understandable and recoverable when conditions aren&#39;t expected. When you don&#39;t have complete information. When the people responding aren&#39;t the people who built it. When time is expensive.</p>\n<p>You start designing differently. Not necessarily better—sometimes the right design is still the simple one. But you design with the knowledge that the system will eventually teach you what you got wrong, and the question is whether you&#39;ve made it possible to learn that lesson without catastrophic cost.</p>\n<p>You write different documentation. Not more documentation—more documentation is often worse. But documentation that captures why, not just what. Documentation that names the assumptions. Documentation that future-you, woken up at 3 AM and trying to understand what state the system is in, will actually use.</p>\n<p>You test differently. Not just testing the happy path and the error paths. Testing the transitions. Testing what happens when error paths stack. Testing what happens when recovery takes longer than expected. Testing what happens when the test itself is wrong.</p>\n<p>And you think about ownership differently. Not as credit, but as responsibility. Not as &quot;I built this,&quot; but as &quot;I&#39;m accountable for what this does in an environment I don&#39;t control.&quot;</p>\n<p>That motor control system got fixed. The race condition was patched. We added instrumentation to characterize interrupt timing in production. We updated commissioning procedures to include the checks we&#39;d skipped.</p>\n<p>But more than that: I stopped being surprised when systems behaved in ways I hadn&#39;t anticipated. I started assuming they would. And I started designing for that assumption.</p>\n<p>Because the first incident taught me something no design review ever could: the system you build is not the system that runs in production.</p>\n<p>Production adds variables you didn&#39;t model. Pressures you didn&#39;t simulate. Dependencies you didn&#39;t document. And people who need answers you don&#39;t have yet.</p>\n<p>The question isn&#39;t whether you&#39;ll face that gap. The question is whether you&#39;ve designed for it.</p>\n<p>Most of the time, you haven&#39;t.</p>\n<p>And that&#39;s okay—as long as you remember it.</p>\n<p>The first incident won&#39;t be your last. But if you learn from it, the next one will be different.</p>\n<p>Not easier. Just different.</p>\n<p>And maybe, slowly, you&#39;ll build systems that fail in ways that are less surprising, less catastrophic, and more recoverable.</p>\n<p>That&#39;s not mastery. That&#39;s just experience.</p>\n<p>And it starts with that first call at 2:47 AM.</p>\n","rawContent":"\nThe pager goes off at 2:47 AM. You're the firmware lead for a new motor control system that's been in production for six weeks. It's been running fine. No issues. And then: \"Line 3 emergency stop. Controllers unresponsive. Production halted.\"\n\nYou're on a call by 2:52. The plant manager is already there—in person, at the facility, at 3 AM. The line is still down. Every minute costs money you've only thought about abstractly until now. The operators are watching. Maintenance is standing by. And everyone is looking at your system.\n\nNot metaphorically looking. Actually standing in front of the cabinet, pointing at LEDs, asking what they mean.\n\nYou realize, with a clarity that's almost physical, that you don't know. You know what they're supposed to mean. You wrote the documentation. But right now, with the system in an unknown state, you're not sure. You're running mental simulations, trying to map LED patterns to states, wondering if the watchdog triggered or if it's a CAN bus fault or if something else entirely happened.\n\nThe plant manager asks: \"How long until we're back up?\"\n\nThis is the moment. Not the moment you become an experienced engineer. The moment you realize you weren't one yet.\n\n## When Ownership Becomes Real\n\nBefore your first real incident, ownership is theoretical. You own the firmware, sure. Your name is on the commit history. You wrote the architecture doc. You presented at the design review.\n\nBut that's ownership as authorship. Ownership as credit.\n\nReal ownership is different. Real ownership is: when this breaks, you get called. When it misbehaves, you explain why. When someone needs to make a decision about whether to push forward or shut down, they're looking at you for information that might not exist yet.\n\nThe shift happens fast. One moment you're proud of what you built. The next moment you're responsible for it in a way that makes pride seem quaint.\n\nI remember my first significant incident. A PLC I'd written firmware for started dropping Modbus requests unpredictably. Not often—maybe one in ten thousand. Enough to be noticeable in production but rare enough that we'd never caught it in testing. The system had error handling. It would retry. But the retries added latency, and that latency cascaded into other systems, and suddenly a water treatment facility was dealing with tank levels that were drifting outside normal operating ranges.\n\nNo one was angry. Everyone was professional. But I could feel the weight of it: this wasn't my code anymore. It was their water treatment system. Their compliance requirements. Their operators who had to explain to management why levels were fluctuating.\n\nThe code was the same. The system was the same. But what it meant was different.\n\n## How Teams Behave Under Public Failure\n\nHere's something they don't teach you: teams change during incidents.\n\nThe usual dynamics suspend. The person who never speaks up in meetings suddenly has crucial information. The senior engineer who usually drives decisions steps back and lets the person closest to the problem lead. Or sometimes the opposite happens—someone who's normally collaborative becomes territorial, defensive.\n\nYou learn who stays calm and who doesn't. Who asks clarifying questions and who jumps to conclusions. Who admits when they don't know something and who deflects. Who thinks about the system and who thinks about blame.\n\nThis isn't about good people versus bad people. It's about how pressure reveals what people actually optimize for when the stakes are real.\n\nI've watched a junior technician with three months on the job diagnose a problem faster than anyone else because they'd been the one doing the daily rounds and noticed a pattern no one else had seen. I've watched a principal engineer who designed the original system defer to an operator who knew which breaker \"acted funny\" in a way no documentation captured.\n\nI've also watched teams spiral. Someone suggests a theory, and instead of testing it, everyone starts building on it. Someone makes a change without announcing it, and now two people are modifying the same system with different assumptions. Someone gets frustrated and starts blaming the vendor, the previous team, the budget constraints—anything except the current problem.\n\nThe best incident response I've seen wasn't the fastest. It was the most deliberate. Someone—it happened to be a controls engineer who'd been with the company for fifteen years—said: \"We don't understand what state we're in. Before we change anything, let's gather data.\" And then, critically: \"Who's writing this down?\"\n\nThat changed everything. Not because documentation mattered in the moment, but because it forced everyone to externalize their mental model. When you have to say out loud what you think is happening and someone writes it down, you think differently. You catch your own assumptions.\n\n## What Broke Wasn't the System\n\nAfter the incident, there's always a postmortem. And almost always, the postmortem focuses on the technical failure.\n\nIn that motor control incident at 3 AM, the technical root cause was clear: a race condition in the watchdog handling code. Under specific timing conditions, the watchdog could timeout while a critical section was locked, and the recovery path assumed clean state that didn't exist. Textbook bug. We fixed it in forty lines of code.\n\nBut that wasn't what broke.\n\nWhat broke was that the firmware had been written with assumptions about the execution environment that were true on the test bench and false in production. The test bench had consistent loop timing. Production had variable timing because of interrupt patterns we hadn't characterized. We'd tested the watchdog recovery path, but we'd tested it by triggering the watchdog deliberately, not by letting it trigger from timing variance.\n\nOkay, but that still sounds technical. Go deeper.\n\nWhy didn't we characterize the interrupt patterns in production? Because commissioning was scheduled tight, and characterization takes time, and we had twelve other systems to bring up. \n\nWhy was commissioning scheduled tight? Because the project was already over budget, and the plant needed the new line operational before the next quarter.\n\nWhy was the project over budget? Partly because the scope grew during implementation, partly because integration with legacy systems took longer than estimated, partly because we'd optimized the bid to win the contract.\n\nWho decided that the commissioning schedule was more important than thorough characterization? No one, explicitly. It was a collective drift. A series of small decisions that each made sense locally but accumulated into a gap where critical testing didn't happen.\n\nHere's what actually broke: the communication path between the firmware team and the commissioning team. We didn't have a clear handoff protocol for \"things that need to be validated in production that we can't validate in the lab.\" That's not a technical problem. That's an organizational design problem.\n\nAnd beneath that: the incentive structure. Commissioning engineers were measured on schedule adherence. Firmware engineers were measured on feature completion. No one was measured on \"probability we understand the system's actual behavior in production.\"\n\nSo we didn't do it. Not because anyone was negligent. Because the organization wasn't designed to value it.\n\n## Why Technical Postmortems Often Miss the Point\n\nMost postmortems I've read follow a pattern:\n\n**Incident summary**: What happened and when  \n**Impact**: Who was affected and how  \n**Root cause**: The technical failure  \n**Contributing factors**: Other technical issues  \n**Action items**: Technical fixes\n\nThis format is comfortable because it suggests the problem was technical and therefore fixable. Change the code, add a check, improve the test suite. Done.\n\nBut look at what's missing:\n\n- Why did the design review not catch this failure mode?\n- What information existed that wasn't shared?\n- Which tradeoffs were made consciously versus unconsciously?\n- What incentives led to those tradeoffs?\n- How did the team's understanding of the system differ from reality?\n\nThese questions are harder because the answers implicate decisions, not just code. They make people uncomfortable because they suggest the incident wasn't just bad luck or an obscure bug—it was predictable given how the system was designed and how the organization operates.\n\nI once sat in a postmortem for a system that failed because of insufficient input validation. The root cause was listed as \"missing bounds check.\" The action item was \"add bounds checking to all inputs.\"\n\nBut the actual story was different. The bounds checking had been in the original design. It was removed during optimization because it added 2ms to the control loop latency, and the spec required sub-10ms response time. The decision to remove it was documented in a code review but not escalated. The person who reviewed it assumed someone else would catch it in integration testing. The integration testing was abbreviated because commissioning was behind schedule.\n\nThe missing bounds check was the mechanism of failure. But what failed was a web of assumptions about who was responsible for verifying what, under what time pressure, with what communication overhead.\n\nFixing the bounds check addressed the symptom. It didn't address why a known-critical validation got removed without proper scrutiny.\n\n## \"The System Worked Exactly as Designed\"\n\nThis phrase appears in postmortems as a conclusion. It's meant to close the investigation: there was no malfunction, just an unanticipated scenario.\n\nBut it's the most dangerous phrase in incident analysis because it's almost always true—and almost always misunderstood.\n\nYes, the system worked as designed. The problem is that \"the design\" includes far more than you documented.\n\nIt includes the implicit assumptions you made about the operating environment. The tradeoffs you accepted to meet the schedule. The risks you deprioritized because they seemed unlikely. The monitoring you didn't implement because it wasn't in scope. The operational knowledge that exists only in people's heads.\n\nWhen the motor controllers became unresponsive at 2:47 AM, they worked exactly as designed: the watchdog detected a timeout, triggered the recovery path, and entered a safe state. The recovery path was designed to reset the system to a known-good state. It did that.\n\nWhat it didn't do was account for the scenario where the \"known-good state\" wasn't actually safe because other systems were depending on outputs that were now frozen at their last value. That wasn't a bug in the recovery logic. That was a gap in the system-level design.\n\nBut more than that: it was a gap in how we thought about the system. We'd designed the controller firmware in isolation, with defined interfaces. We'd assumed those interfaces were sufficient to capture the dependencies. They weren't. The actual dependencies included timing relationships, implicit state machines in other systems, and operator expectations that weren't written anywhere.\n\nThe system worked exactly as designed. The design was incomplete.\n\n## The Difference Between Intent and Reality\n\nThere's a moment during every significant incident where you realize: we built what we said we'd build. We just didn't build what was needed.\n\nNot because we were incompetent. Because reality is richer than specification.\n\nThe spec said \"handle watchdog timeout.\" It didn't say \"handle watchdog timeout in a way that doesn't leave dependent systems in ambiguous state.\" That seemed implied. It wasn't.\n\nThe spec said \"buffer sensor data during communication loss.\" It didn't say \"buffer data in a way that's meaningful when different sensors lose communication at different times.\" We assumed synchronization. The assumption was wrong.\n\nThe spec said \"provide HMI feedback for fault conditions.\" It didn't say \"provide feedback that operators can interpret correctly at 3 AM when multiple faults are active simultaneously.\" We tested each fault individually. They don't happen individually in production.\n\nIntent and reality diverge in the space between what you specify and what you assume. And you don't discover what you assumed until it's tested in an environment that doesn't share your assumptions.\n\n## What Changes After\n\nThe first incident changes everything because it changes what \"working\" means.\n\nBefore: working meant passing tests, meeting specifications, behaving correctly under expected conditions.\n\nAfter: working means remaining understandable and recoverable when conditions aren't expected. When you don't have complete information. When the people responding aren't the people who built it. When time is expensive.\n\nYou start designing differently. Not necessarily better—sometimes the right design is still the simple one. But you design with the knowledge that the system will eventually teach you what you got wrong, and the question is whether you've made it possible to learn that lesson without catastrophic cost.\n\nYou write different documentation. Not more documentation—more documentation is often worse. But documentation that captures why, not just what. Documentation that names the assumptions. Documentation that future-you, woken up at 3 AM and trying to understand what state the system is in, will actually use.\n\nYou test differently. Not just testing the happy path and the error paths. Testing the transitions. Testing what happens when error paths stack. Testing what happens when recovery takes longer than expected. Testing what happens when the test itself is wrong.\n\nAnd you think about ownership differently. Not as credit, but as responsibility. Not as \"I built this,\" but as \"I'm accountable for what this does in an environment I don't control.\"\n\nThat motor control system got fixed. The race condition was patched. We added instrumentation to characterize interrupt timing in production. We updated commissioning procedures to include the checks we'd skipped.\n\nBut more than that: I stopped being surprised when systems behaved in ways I hadn't anticipated. I started assuming they would. And I started designing for that assumption.\n\nBecause the first incident taught me something no design review ever could: the system you build is not the system that runs in production.\n\nProduction adds variables you didn't model. Pressures you didn't simulate. Dependencies you didn't document. And people who need answers you don't have yet.\n\nThe question isn't whether you'll face that gap. The question is whether you've designed for it.\n\nMost of the time, you haven't.\n\nAnd that's okay—as long as you remember it.\n\nThe first incident won't be your last. But if you learn from it, the next one will be different.\n\nNot easier. Just different.\n\nAnd maybe, slowly, you'll build systems that fail in ways that are less surprising, less catastrophic, and more recoverable.\n\nThat's not mastery. That's just experience.\n\nAnd it starts with that first call at 2:47 AM."}},"__N_SSG":true}