{"pageProps":{"post":{"slug":"the-happy-post-lie","title":"The Happy Path Is a Lie We Tell Ourselves","date":"2025-12-01","excerpt":"Design reviews reward optimism. Test environments validate assumptions. And somewhere between approval and deployment, we forget that we're building systems for a world that doesn't care about our diagrams.","author":{"name":"Inderpreet Singh","avatar":"IS"},"image":"/images/posts/design-review.png","tags":["systems","design","production","failure"],"likes":0,"comments":0,"content":"<p>Three engineers sit in a design review for a new temperature monitoring system. The architecture is clean: sensors report to edge controllers, controllers aggregate to a gateway, gateway publishes to the cloud. Redundancy at every layer. Graceful degradation clearly marked on the diagram.</p>\n<p>Someone asks: &quot;What happens if the gateway loses connectivity?&quot;</p>\n<p>&quot;It buffers locally for up to 72 hours,&quot; comes the answer. &quot;More than enough for any reasonable outage.&quot;</p>\n<p>Everyone nods. The design is approved.</p>\n<p>Two years later, a cellular provider pushes a configuration update that breaks connectivity for five days. The gateway&#39;s flash memory fills in eighteen hours. When connectivity returns, 96 hours of critical temperature data is gone. The system worked exactly as designed—it just wasn&#39;t designed for this.</p>\n<p>The happy path is seductive because it lets us move forward. But it&#39;s also a lie we tell ourselves, and design reviews are where that lie gets institutionalized.</p>\n<h2>Why Design Reviews Reward Optimism</h2>\n<p>Design reviews are supposed to find problems. In practice, they often do the opposite: they create consensus around the assumption that problems won&#39;t happen.</p>\n<p>Here&#39;s how it works:</p>\n<p>You present a design. You show the nominal flow. You mark the error paths. You explain the redundancies. And then the questions come—but they come in a specific form: &quot;What if X fails?&quot; You answer with your contingency for X. &quot;What if Y happens?&quot; You show your handling of Y.</p>\n<p>Each question asked and answered creates the illusion that you&#39;ve covered the space of possible failures. What&#39;s harder to see is the space of failures that weren&#39;t asked about—not because they&#39;re impossible, but because they&#39;re hard to imagine from a conference room.</p>\n<p>The cellular configuration update that breaks connectivity for five days isn&#39;t a question anyone asks, because connectivity outages are supposed to last hours, not days. The sensor that doesn&#39;t fail cleanly but drifts slowly enough to stay within acceptance bounds for months isn&#39;t on the checklist, because sensors are supposed to either work or fail obviously. The operator who learns to bypass an interlock because it trips too often during valid operations isn&#39;t in the room, because we&#39;re reviewing technical design, not operational reality.</p>\n<p>Design reviews optimize for demonstrable coverage of known failure modes. They reward the ability to show that you&#39;ve thought about things. But &quot;thinking about things&quot; is different from designing for them, and both are different from experiencing them.</p>\n<p>This creates a subtle bias: the designs that pass review most easily are the ones that look most robust on paper. Clean boundaries. Clear error handling. Documented assumptions. The designs that acknowledge fundamental uncertainties—&quot;we don&#39;t know how operators will actually use this,&quot; &quot;we can&#39;t predict how this will interact with the legacy system at scale&quot;—feel incomplete. They sound like excuses.</p>\n<p>So we learn to present certainty. We learn to have answers. And slowly, the happy path becomes the only path we&#39;re willing to defend.</p>\n<h2>How Organizations Institutionalize Blind Spots</h2>\n<p>Individual engineers know the happy path is optimistic. But organizations have a way of turning individual caution into collective blindness.</p>\n<p>Consider what happens after that design review. The design is approved. It goes into a requirements document. The requirements become tasks. The tasks become sprints. And at each translation, something is lost.</p>\n<p>The subtle caveat—&quot;this assumes network partitions are transient&quot;—becomes &quot;handles network failures.&quot; The hedge—&quot;buffering capacity should be sufficient for typical outages&quot;—becomes &quot;72-hour buffer.&quot; The uncertainty—&quot;we&#39;ll need to monitor how this behaves under load&quot;—becomes a checkbox: &quot;performance tested.&quot;</p>\n<p>This isn&#39;t malice. It&#39;s how organizations create actionable plans from ambiguous reality. But in the process, assumptions get promoted to facts, and facts get encoded into architecture.</p>\n<p>Worse, once something is designed and built, it becomes expensive to question. Not just financially expensive—politically expensive. The team that built it has invested in it. Managers have reported progress on it. Customers have been promised it. To say &quot;we need to rethink this&quot; is to say all that investment might have been misdirected.</p>\n<p>So instead, we add compensating controls. We build monitoring. We write runbooks. We train operators. Each addition reinforces the original design rather than questioning it. We&#39;re not asking &quot;should this system exist in this form?&quot; We&#39;re asking &quot;how do we make this system work?&quot;</p>\n<p>I&#39;ve sat in meetings where everyone in the room privately knew a system was brittle, but no one said it directly because the system was already in production and replacing it would be a six-month project. Instead, we talked about &quot;hardening&quot; and &quot;resilience improvements&quot;—language that suggested we were making something robust rather than patching something fundamentally fragile.</p>\n<p>The organization&#39;s immune system had learned to reject the observation that the system was designed wrong, because accepting that observation would require acknowledging that a lot of other decisions were also wrong.</p>\n<h2>Most Failures Are Designed</h2>\n<p>Here&#39;s an uncomfortable truth: most production failures aren&#39;t accidents. They&#39;re not the result of bugs that slipped through testing or edge cases that no one thought of.</p>\n<p>They&#39;re the inevitable outcome of decisions made under constraints.</p>\n<p>That temperature monitoring system that lost 96 hours of data? The decision to use flash memory with limited write endurance was made to hit a cost target. The decision to buffer for 72 hours was made based on historical uptime data from a different cellular provider. The decision not to implement hierarchical buffering (edge → gateway → cloud) was made to keep the architecture simple and shippable.</p>\n<p>None of those were wrong decisions in isolation. Given the constraints—budget, schedule, what was known at the time—they were defensible. Reasonable, even.</p>\n<p>But they were decisions, not accidents. And decisions have consequences that aren&#39;t always visible until they compound.</p>\n<p>This is what I mean when I say most failures are designed. Not that anyone set out to build a fragile system, but that fragility is often the natural result of optimizing for other things: speed, cost, simplicity, familiarity.</p>\n<p>The difference between a bug and a decision is that bugs can be fixed. Decisions are encoded into the architecture. They become load-bearing assumptions. You can&#39;t fix them without rethinking the system.</p>\n<p>When an incident review concludes &quot;the system worked as designed, but we didn&#39;t anticipate this scenario,&quot; what they&#39;re really saying is: &quot;we made tradeoffs, and this is what we traded away.&quot;</p>\n<p>The question is whether we&#39;re honest about what we&#39;re trading. Most of the time, we&#39;re not—because being honest would make it harder to get the design approved.</p>\n<h2>Why Test, Staging, and Simulation Always Mislead</h2>\n<p>Every environment before production is a curated experience.</p>\n<p>Test environments use clean data. Staging uses a subset of production scale. Simulations use models that abstract away complexity. Even load testing is fundamentally artificial—you generate the load, you choose when to apply it, you know what you&#39;re testing for.</p>\n<p>This isn&#39;t a criticism of testing. Testing is essential. But it&#39;s also fundamentally limited, and we consistently underestimate how limited it is.</p>\n<p>Here&#39;s what test environments can&#39;t show you:</p>\n<p><strong>They can&#39;t show you emergent behavior.</strong> That interaction between the VFD noise and the CAN bus that only manifests when both systems are under load and the ambient temperature is above 30°C? Your test bench runs at 22°C with one system at a time.</p>\n<p><strong>They can&#39;t show you operational reality.</strong> The operator who learned that if you cycle the power on the HMI in a specific sequence, you can temporarily bypass an error condition that otherwise requires a maintenance window? They discovered that in production, under pressure, when the line manager was demanding a workaround.</p>\n<p><strong>They can&#39;t show you the full dependency graph.</strong> You tested integration with the ERP system. You didn&#39;t test integration with the ERP system while the network team is doing maintenance and traffic is rerouting through a secondary path with higher latency and the backup MES is handling requests because the primary is being patched.</p>\n<p><strong>They can&#39;t show you time.</strong> That sensor calibration drift that takes six months to become problematic? Your acceptance test runs for six hours.</p>\n<p><strong>They can&#39;t show you organizational dynamics.</strong> Who gets called when something ambiguous happens at 2 AM? Who has the authority to make the call to shut down the line? Who actually knows where the documentation is? None of that exists in staging.</p>\n<p>Production is the only environment where all the variables are real, all at once, without anyone curating the experience.</p>\n<h2>What Production Pressure Reveals That Design Never Does</h2>\n<p>There&#39;s a specific kind of knowledge that only emerges under production pressure, and it has nothing to do with technical design.</p>\n<p>It&#39;s the knowledge of what actually matters.</p>\n<p>In design, everything matters equally. Every requirement is important. Every failure mode is worth handling. Every dependency is documented. But in production, under time pressure, with costs accumulating, you discover very quickly what&#39;s truly critical and what was just conceptually important.</p>\n<p>You discover that the &quot;critical&quot; alert that fires three times a day gets ignored, while the informal message in Slack from the night shift operator gets immediate attention because everyone knows that operator only speaks up when something is genuinely wrong.</p>\n<p>You discover that the official escalation path—submit a ticket, wait for triage, get assigned to the on-call engineer—is too slow, and there&#39;s an unofficial path where certain people have certain phone numbers and that&#39;s what actually gets used when things are breaking.</p>\n<p>You discover that the monitoring dashboard everyone insisted on building never gets looked at during incidents, but everyone opens the same three SSH sessions to check the same three log files because that&#39;s where the useful information actually lives.</p>\n<p>You discover that the runbook that took weeks to write is useless because it assumes you have time to read it, and in production you don&#39;t—so people fall back on intuition, pattern matching, and educated guesses.</p>\n<p>None of this is visible during design because design happens in an environment where time is less expensive and mistakes are reversible. Production pressure doesn&#39;t just reveal technical problems. It reveals organizational truth.</p>\n<p>It shows you which abstractions hold up and which ones collapse. It shows you where authority actually lies versus where the org chart says it lies. It shows you which skills matter—and they&#39;re often not the ones that got people promoted.</p>\n<h2>What This Means for How We Design</h2>\n<p>I&#39;m not arguing that we should abandon design reviews or testing or staging environments. They serve a purpose. The problem is that we treat them as validation rather than exploration.</p>\n<p>We treat passing a design review as evidence that the design is good. It&#39;s not. It&#39;s evidence that the design is defensible given what we know now, in this room, without production pressure.</p>\n<p>We treat staging as a high-fidelity simulation of production. It&#39;s not. It&#39;s a curated environment that shares some properties with production and systematically excludes others.</p>\n<p>If we were honest about this, we&#39;d design differently. We&#39;d spend less energy trying to anticipate every failure mode and more energy building systems that can be understood and modified when inevitably surprising failures occur.</p>\n<p>We&#39;d document not just what the system does, but what we assumed about the environment it operates in. Not as a CYA exercise, but as a genuine artifact that helps the next person understand what we were thinking—and where we were probably wrong.</p>\n<p>We&#39;d treat the first six months in production not as &quot;stabilization&quot; but as &quot;learning what we actually built&quot;—because that&#39;s what it is.</p>\n<p>The happy path isn&#39;t useless. It&#39;s necessary to ship anything at all. But it&#39;s a lie we tell ourselves to make progress in the face of uncertainty.</p>\n<p>The question is whether we remember it&#39;s a lie—or whether we start believing it.</p>\n<p>Because the system will tell the truth eventually.</p>\n<p>It always does.</p>\n","rawContent":"\r\nThree engineers sit in a design review for a new temperature monitoring system. The architecture is clean: sensors report to edge controllers, controllers aggregate to a gateway, gateway publishes to the cloud. Redundancy at every layer. Graceful degradation clearly marked on the diagram.\r\n\r\nSomeone asks: \"What happens if the gateway loses connectivity?\"\r\n\r\n\"It buffers locally for up to 72 hours,\" comes the answer. \"More than enough for any reasonable outage.\"\r\n\r\nEveryone nods. The design is approved.\r\n\r\nTwo years later, a cellular provider pushes a configuration update that breaks connectivity for five days. The gateway's flash memory fills in eighteen hours. When connectivity returns, 96 hours of critical temperature data is gone. The system worked exactly as designed—it just wasn't designed for this.\r\n\r\nThe happy path is seductive because it lets us move forward. But it's also a lie we tell ourselves, and design reviews are where that lie gets institutionalized.\r\n\r\n## Why Design Reviews Reward Optimism\r\n\r\nDesign reviews are supposed to find problems. In practice, they often do the opposite: they create consensus around the assumption that problems won't happen.\r\n\r\nHere's how it works:\r\n\r\nYou present a design. You show the nominal flow. You mark the error paths. You explain the redundancies. And then the questions come—but they come in a specific form: \"What if X fails?\" You answer with your contingency for X. \"What if Y happens?\" You show your handling of Y.\r\n\r\nEach question asked and answered creates the illusion that you've covered the space of possible failures. What's harder to see is the space of failures that weren't asked about—not because they're impossible, but because they're hard to imagine from a conference room.\r\n\r\nThe cellular configuration update that breaks connectivity for five days isn't a question anyone asks, because connectivity outages are supposed to last hours, not days. The sensor that doesn't fail cleanly but drifts slowly enough to stay within acceptance bounds for months isn't on the checklist, because sensors are supposed to either work or fail obviously. The operator who learns to bypass an interlock because it trips too often during valid operations isn't in the room, because we're reviewing technical design, not operational reality.\r\n\r\nDesign reviews optimize for demonstrable coverage of known failure modes. They reward the ability to show that you've thought about things. But \"thinking about things\" is different from designing for them, and both are different from experiencing them.\r\n\r\nThis creates a subtle bias: the designs that pass review most easily are the ones that look most robust on paper. Clean boundaries. Clear error handling. Documented assumptions. The designs that acknowledge fundamental uncertainties—\"we don't know how operators will actually use this,\" \"we can't predict how this will interact with the legacy system at scale\"—feel incomplete. They sound like excuses.\r\n\r\nSo we learn to present certainty. We learn to have answers. And slowly, the happy path becomes the only path we're willing to defend.\r\n\r\n## How Organizations Institutionalize Blind Spots\r\n\r\nIndividual engineers know the happy path is optimistic. But organizations have a way of turning individual caution into collective blindness.\r\n\r\nConsider what happens after that design review. The design is approved. It goes into a requirements document. The requirements become tasks. The tasks become sprints. And at each translation, something is lost.\r\n\r\nThe subtle caveat—\"this assumes network partitions are transient\"—becomes \"handles network failures.\" The hedge—\"buffering capacity should be sufficient for typical outages\"—becomes \"72-hour buffer.\" The uncertainty—\"we'll need to monitor how this behaves under load\"—becomes a checkbox: \"performance tested.\"\r\n\r\nThis isn't malice. It's how organizations create actionable plans from ambiguous reality. But in the process, assumptions get promoted to facts, and facts get encoded into architecture.\r\n\r\nWorse, once something is designed and built, it becomes expensive to question. Not just financially expensive—politically expensive. The team that built it has invested in it. Managers have reported progress on it. Customers have been promised it. To say \"we need to rethink this\" is to say all that investment might have been misdirected.\r\n\r\nSo instead, we add compensating controls. We build monitoring. We write runbooks. We train operators. Each addition reinforces the original design rather than questioning it. We're not asking \"should this system exist in this form?\" We're asking \"how do we make this system work?\"\r\n\r\nI've sat in meetings where everyone in the room privately knew a system was brittle, but no one said it directly because the system was already in production and replacing it would be a six-month project. Instead, we talked about \"hardening\" and \"resilience improvements\"—language that suggested we were making something robust rather than patching something fundamentally fragile.\r\n\r\nThe organization's immune system had learned to reject the observation that the system was designed wrong, because accepting that observation would require acknowledging that a lot of other decisions were also wrong.\r\n\r\n## Most Failures Are Designed\r\n\r\nHere's an uncomfortable truth: most production failures aren't accidents. They're not the result of bugs that slipped through testing or edge cases that no one thought of.\r\n\r\nThey're the inevitable outcome of decisions made under constraints.\r\n\r\nThat temperature monitoring system that lost 96 hours of data? The decision to use flash memory with limited write endurance was made to hit a cost target. The decision to buffer for 72 hours was made based on historical uptime data from a different cellular provider. The decision not to implement hierarchical buffering (edge → gateway → cloud) was made to keep the architecture simple and shippable.\r\n\r\nNone of those were wrong decisions in isolation. Given the constraints—budget, schedule, what was known at the time—they were defensible. Reasonable, even.\r\n\r\nBut they were decisions, not accidents. And decisions have consequences that aren't always visible until they compound.\r\n\r\nThis is what I mean when I say most failures are designed. Not that anyone set out to build a fragile system, but that fragility is often the natural result of optimizing for other things: speed, cost, simplicity, familiarity.\r\n\r\nThe difference between a bug and a decision is that bugs can be fixed. Decisions are encoded into the architecture. They become load-bearing assumptions. You can't fix them without rethinking the system.\r\n\r\nWhen an incident review concludes \"the system worked as designed, but we didn't anticipate this scenario,\" what they're really saying is: \"we made tradeoffs, and this is what we traded away.\"\r\n\r\nThe question is whether we're honest about what we're trading. Most of the time, we're not—because being honest would make it harder to get the design approved.\r\n\r\n## Why Test, Staging, and Simulation Always Mislead\r\n\r\nEvery environment before production is a curated experience.\r\n\r\nTest environments use clean data. Staging uses a subset of production scale. Simulations use models that abstract away complexity. Even load testing is fundamentally artificial—you generate the load, you choose when to apply it, you know what you're testing for.\r\n\r\nThis isn't a criticism of testing. Testing is essential. But it's also fundamentally limited, and we consistently underestimate how limited it is.\r\n\r\nHere's what test environments can't show you:\r\n\r\n**They can't show you emergent behavior.** That interaction between the VFD noise and the CAN bus that only manifests when both systems are under load and the ambient temperature is above 30°C? Your test bench runs at 22°C with one system at a time.\r\n\r\n**They can't show you operational reality.** The operator who learned that if you cycle the power on the HMI in a specific sequence, you can temporarily bypass an error condition that otherwise requires a maintenance window? They discovered that in production, under pressure, when the line manager was demanding a workaround.\r\n\r\n**They can't show you the full dependency graph.** You tested integration with the ERP system. You didn't test integration with the ERP system while the network team is doing maintenance and traffic is rerouting through a secondary path with higher latency and the backup MES is handling requests because the primary is being patched.\r\n\r\n**They can't show you time.** That sensor calibration drift that takes six months to become problematic? Your acceptance test runs for six hours.\r\n\r\n**They can't show you organizational dynamics.** Who gets called when something ambiguous happens at 2 AM? Who has the authority to make the call to shut down the line? Who actually knows where the documentation is? None of that exists in staging.\r\n\r\nProduction is the only environment where all the variables are real, all at once, without anyone curating the experience.\r\n\r\n## What Production Pressure Reveals That Design Never Does\r\n\r\nThere's a specific kind of knowledge that only emerges under production pressure, and it has nothing to do with technical design.\r\n\r\nIt's the knowledge of what actually matters.\r\n\r\nIn design, everything matters equally. Every requirement is important. Every failure mode is worth handling. Every dependency is documented. But in production, under time pressure, with costs accumulating, you discover very quickly what's truly critical and what was just conceptually important.\r\n\r\nYou discover that the \"critical\" alert that fires three times a day gets ignored, while the informal message in Slack from the night shift operator gets immediate attention because everyone knows that operator only speaks up when something is genuinely wrong.\r\n\r\nYou discover that the official escalation path—submit a ticket, wait for triage, get assigned to the on-call engineer—is too slow, and there's an unofficial path where certain people have certain phone numbers and that's what actually gets used when things are breaking.\r\n\r\nYou discover that the monitoring dashboard everyone insisted on building never gets looked at during incidents, but everyone opens the same three SSH sessions to check the same three log files because that's where the useful information actually lives.\r\n\r\nYou discover that the runbook that took weeks to write is useless because it assumes you have time to read it, and in production you don't—so people fall back on intuition, pattern matching, and educated guesses.\r\n\r\nNone of this is visible during design because design happens in an environment where time is less expensive and mistakes are reversible. Production pressure doesn't just reveal technical problems. It reveals organizational truth.\r\n\r\nIt shows you which abstractions hold up and which ones collapse. It shows you where authority actually lies versus where the org chart says it lies. It shows you which skills matter—and they're often not the ones that got people promoted.\r\n\r\n## What This Means for How We Design\r\n\r\nI'm not arguing that we should abandon design reviews or testing or staging environments. They serve a purpose. The problem is that we treat them as validation rather than exploration.\r\n\r\nWe treat passing a design review as evidence that the design is good. It's not. It's evidence that the design is defensible given what we know now, in this room, without production pressure.\r\n\r\nWe treat staging as a high-fidelity simulation of production. It's not. It's a curated environment that shares some properties with production and systematically excludes others.\r\n\r\nIf we were honest about this, we'd design differently. We'd spend less energy trying to anticipate every failure mode and more energy building systems that can be understood and modified when inevitably surprising failures occur.\r\n\r\nWe'd document not just what the system does, but what we assumed about the environment it operates in. Not as a CYA exercise, but as a genuine artifact that helps the next person understand what we were thinking—and where we were probably wrong.\r\n\r\nWe'd treat the first six months in production not as \"stabilization\" but as \"learning what we actually built\"—because that's what it is.\r\n\r\nThe happy path isn't useless. It's necessary to ship anything at all. But it's a lie we tell ourselves to make progress in the face of uncertainty.\r\n\r\nThe question is whether we remember it's a lie—or whether we start believing it.\r\n\r\nBecause the system will tell the truth eventually.\r\n\r\nIt always does."}},"__N_SSG":true}